<?php


return [
    /*
    |--------------------------------------------------------------------------
    | Failed Messages
    |--------------------------------------------------------------------------
    |
    | The following language lines are the arabic lines which match reasons
    | that in any filed occur in any position in the system
    |
    */

    //===================================================================================
    // PUBLIC============================================================================
    //===================================================================================
    'failed'=>'حدث خطأ ما الرجاء المحاولة مرة أخرى',
    'authorize'=>'أنت غير مصرح لك بالدخول',


    //===================================================================================
    // USERS=============================================================================
    //===================================================================================
    'user.first_name.required'=>'الرجاء ادخال اسم المستخدم الاول',
    'user.first_name.max'=>'اسم المستخدم الاول أطول من اللازم',
    'user.last_name.required'=>'الرجاء ادخال اسم المستخدم الاخير',
    'user.last_name.max'=>'اسم المستخدم الاخير أطول من اللازم',
    'user.email.required'=>'الرجاء ادخال البريد الالكتروني',
    'user.email.email'=>'الرجاء ادخال بريد الكتروني صحيح',
    'user.email.unique'=>'هذا البريد الالكتروني مستخدم بالفعل',
    'user.password.required'=>'الرجاء ادخال كلمة السر',
    'user.password.same'=>'كلمة السر وتأكيدها غير متطابقان الرجاء المحاولة مرة اخرى',
    'user.roles_name.required'=>'حدث خطأ ما الرجاء المحاولة مرة اخرى',
    'user.roles_name.exists'=>'حدث خطأ ما الرجاء المحاولة مرة أخرى',
    'user.pic.mimes'=>'يجب اختيار صورة منا امتداد: jpeg, jpg, png, svg',
    'user.pic.max'=>'حجم الصورة كبير جدا الرجاء اختيار صورة شخصية بحجم أقل',
    'user.code.required'=>'الكود مطلوب',
    'user.code.string'=>'الرجاء كتابة الكود بطريقة صحيحة',
    'user.code.size'=>'يجب ان يكون حجم الكود 8 احرف',
    'user.mobile_number.required'=>'رقم الهاتف مطلوب',
    'user.mobile_number.string'=>'الرجاء كتابة رقم هاتف صحيح',
    'user.mobile_number.regex'=>'يجب ان يتكون رقم الهاتف من 10 ارقام',
    'user.city_id.required'=>'الرجاء اختيار المدينة',
    'user.city_id.numeric'=>'حدث خطا ما الرجاء اعادة المحاولة',
    'user.city_id.exists'=>'حدث خطا ما الرجاء اعادة المحاولة',
    'user.notFound'=>'هذا المستخدم غير موجود',

    //===================================================================================
    // SETTINGS==========================================================================
    //===================================================================================
    'setting.display_name.required' => 'اسم العرض مطلوب',
    'setting.display_name.string' => 'هناك خطأ ما، يُرجى المحاولة مرة أخرى',
    'setting.namespace.required' => 'النطاق مطلوب',
    'setting.namespace.string' => 'هناك خطأ ما، يُرجى المحاولة مرة أخرى',
    'setting.key.required' => 'المفتاح مطلوب',
    'setting.key.string' => 'هناك خطأ ما، يُرجى المحاولة مرة أخرى',
    'setting.key.unique' => 'المفتاح مُستخدم بالفعل',
    'setting.type.required' => 'يرجى اختيار نوع القيمة',
    'setting.type.in' => 'يرجى اختيار نوع القيمة',
    'setting.value.required' => 'القيمة مطلوبة',


    //===================================================================================
    // CITIES============================================================================
    //===================================================================================
    'city.name.required' => 'اسم المدينة مطلوب',
    'city.name.string' => 'هناك خطأ ما. يرجى المحاولة مرة أخرى',
    'city.name.max' => 'يجب ألا يتجاوز اسم المدينة 30 حرفًا',
    'city.state_id.required' => 'الرجاء اختيار الولاية',
    'city.state_id.numeric' => 'هناك خطأ ما. يرجى المحاولة مرة أخرى',
    'city.state_id.exists' => 'هناك خطأ ما. يرجى المحاولة مرة أخرى',

];
