<?php


return [
    /*
    |--------------------------------------------------------------------------
    | Failed Messages
    |--------------------------------------------------------------------------
    |
    | The following language lines are the arabic lines which match reasons
    | that in any success occur in any position in the system
    |
    */


    //===================================================================================
    // USERS=============================================================================
    //===================================================================================
    'user.add.success'=>'تم اضافة المستخدم بنجاح',
    'user.destroy'=>'تم حذف المستخدم بنجاح',
    'user.edit'=>'تم تحديث بيانات المستخدم بنجاح',
];
