<?php
return [
    'title' => 'المستخدمين',
    'definitions' => 'التعاريف',
    'users' => 'المستخدمين',
    'add.user' => 'إضافة مستخدم',
    'name' => 'الاسم',
    'email' => 'البريد الإلكتروني',
    'mobile' => 'الجوال',
    'state' => 'الحالة',
    'city' => 'المدينة',
    'role' => 'الدور',
    'code' => 'الكود',
    'action' => 'الإجراءات',
    'are.you.sure' => 'هل أنت متأكد؟',
    'not.able.revert' => 'لن تكون قادرًا على التراجع عن هذا!',
    'deleted' => 'تم الحذف!',
    'delete' => 'حذف!',
];
